Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsData.Assign(Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsData)
Assigns values of the source data to this object.
other:
The source data.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsData.IsEqual(Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsData)
Check if the contents of two graphics datas are equal.
other:
The datas to be compared.
Returns:
True for equal, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsData.GraphicsId
Id of the piece of graphics in the DirectContext3D.

Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsData.GraphicsType
Type of the piece of graphics in the DirectContext3D.

Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsData.#ctor(Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsData)
Constructs a copy of source object.
other:
Source object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsData.#ctor(Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsType,System.String)
Constructs an instance of DirectContext3DGraphicsData with provided values.
graphicsType:
Type of the piece of graphics in the DirectContext3D.
graphicsId:
Id of the piece of graphics in the DirectContext3D.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsData.#ctor
Constructs an instance of DirectContext3DGraphicsData with default values.

Autodesk.Revit.DB.DirectContext3D.DirectContext3DGraphicsData
Data for a piece of graphics of a DirectContext3D.